dotfiles/doom/.config/doom/config.org
** ax-custom-prefix: SPC j
why =j=? because its a convenient key to type and surprisingly the namespace was completely empty
#+begin_src emacs-lisp
(map! :leader
      (:prefix-map ("j" . "ax custom binds")
       ;; non-nested
       (:desc "org-capture" "j" #'org-capture)
       (:desc "Toggle Dired Preview (global)" "p" #'dired-preview-global-mode)
       (:desc "visually select a window" "w" #'ace-window)
       (:desc "open terminal (eat)" "RET" #'eat)
       ;; nested
       (:prefix ("d" . "dirvish / delete")
        :desc "dirvish-fd" "f" #'dirvish-fd
        :desc "dirvish-move" "m" #'dirvish-move
        :desc "dirvish-narrow" "n" #'dirvish-narrow
        :desc "delete-pair" "p" #'delete-pair)
       (:prefix ("e" . "elfeed")
        :desc "elfeed" "e" #'elfeed
        :desc "elfeed update" "u" #'elfeed-update)
       (:prefix ("f" . "fzf")
        :desc "Starts fzf session in dir" "f" #'fzf-directory
        :desc "consult-git-grep" "g" #'consult-git-grep
        :desc "consult-ripgrep" "r" #'consult-ripgrep)
       (:prefix ("t" . "testing stuff")
        :desc "hello world" "h" #'ax/my-hello-message
        :desc "print date" "d" #'ax/my-run-date
        :desc "org-babel-tangle" "t" #'org-babel-tangle)))
#+end_src
** toggle
originally taken from DT's config
#+begin_src emacs-lisp
(map! :leader
      (:prefix ("t" . "toggle")
       :desc "Toggle eshell split"            "e" #'+eshell/toggle
       :desc "Toggle line highlight in frame" "h" #'hl-line-mode
       :desc "Toggle line highlight globally" "H" #'global-hl-line-mode
       :desc "Toggle markdown-view-mode"      "M" #'ax/toggle-markdown-mode
       :desc "Toggle truncate lines"          "T" #'toggle-truncate-lines
       :desc "Toggle treemacs"                "t" #'+treemacs/toggle))

;; (map! :leader
;;       (:prefix ("o" . "open here")
;;        :desc "Open eshell here"    "e" #'+eshell/here
;;        :desc "Open vterm here"     "v" #'+vterm/here))
#+end_src

* Markdown

try ~markdown-view-mode~ for a better reading experience!

** Headers
This sets the font size for each markdown header level.  Having variable font sizes in a markdown outline makes it visually appealing and more readable.
#+begin_src emacs-lisp
(custom-set-faces
 '(markdown-header-face ((t (:inherit font-lock-function-name-face :weight bold :family "variable-pitch"))))
 '(markdown-header-face-1 ((t (:inherit markdown-header-face :height 1.6))))
 '(markdown-header-face-2 ((t (:inherit markdown-header-face :height 1.5))))
 '(markdown-header-face-3 ((t (:inherit markdown-header-face :height 1.4))))
 '(markdown-header-face-4 ((t (:inherit markdown-header-face :height 1.3))))
 '(markdown-header-face-5 ((t (:inherit markdown-header-face :height 1.2))))
 '(markdown-header-face-6 ((t (:inherit markdown-header-face :height 1.1)))))
#+end_src

** Toggle Markdown View
A custom function to toggle between standard =markdown-mode= and =markdown-view-mode=.
#+begin_src emacs-lisp
(defun ax/toggle-markdown-mode ()
  "Toggle between `markdown-mode` and `markdown-view-mode`."
  (interactive)
  (if (eq major-mode 'markdown-view-mode)
      (markdown-mode)
    (markdown-view-mode)))
#+end_src
* Org Stuff
** org-directory
#+begin_src emacs-lisp
(setq org-directory "~/org/")
#+end_src

** set different heading sizes
#+begin_src emacs-lisp
(custom-theme-set-faces!
'doom-nord
'(org-level-8 :inherit outline-3 :height 1.0)
'(org-level-7 :inherit outline-3 :height 1.0)
'(org-level-6 :inherit outline-3 :height 1.1)
'(org-level-5 :inherit outline-3 :height 1.2)
'(org-level-4 :inherit outline-3 :height 1.3)
'(org-level-3 :inherit outline-3 :height 1.4)
'(org-level-2 :inherit outline-2 :height 1.5)
'(org-level-1 :inherit outline-1 :height 1.6)
'(org-document-title  :height 1.8 :bold t :underline nil))
#+end_src

#+begin_src emacs-lisp
(custom-theme-set-faces!
'gotham
'(org-level-8 :inherit outline-3 :height 1.0)
'(org-level-7 :inherit outline-3 :height 1.0)
'(org-level-6 :inherit outline-3 :height 1.1)
'(org-level-5 :inherit outline-3 :height 1.2)
'(org-level-4 :inherit outline-3 :height 1.3)
'(org-level-3 :inherit outline-3 :height 1.4)
'(org-level-2 :inherit outline-2 :height 1.5)
'(org-level-1 :inherit outline-1 :height 1.6)
'(org-document-title  :height 1.8 :bold t :underline nil))
#+end_src

* org-capture loop for scratchpad
#+begin_src emacs-lisp
(defun ax/org-capture-loop ()
  "Continuously open `org-capture` after each capture is finalized.
Runs indefinitely until the user aborts with `C-g` or similar."
  (interactive)
  (add-hook 'org-capture-after-finalize-hook #'ax/org-capture--restart)
  (org-capture))

(defun ax/org-capture--restart ()
  "Restart `org-capture` automatically after finalizing a capture."
  ;; Temporarily remove the hook to prevent nested recursion.
  (remove-hook 'org-capture-after-finalize-hook #'ax/org-capture--restart)
  ;; Delay restart slightly so Org finishes cleanup first.
  (run-at-time
   0.1 nil
   (lambda ()
     (add-hook 'org-capture-after-finalize-hook #'ax/org-capture--restart)
     (org-capture))))
#+end_src
* eat terminal
https://codeberg.org/akib/emacs-eat

https://elpa.nongnu.org/nongnu-devel/doc/eat.html

#+begin_src emacs-lisp
(after! eat
  (setq shell-file-name "/run/current-system/sw/bin/fish"
        explicit-shell-file-name "/run/current-system/sw/bin/fish"
        eat-shell "/run/current-system/sw/bin/fish"
        eat-term-name "xterm-256color")
  (set-face-foreground 'eat-term-color-0   "#0c1014")
  (set-face-foreground 'eat-term-color-1   "#c23127")
  (set-face-foreground 'eat-term-color-2   "#2aa889")
  (set-face-foreground 'eat-term-color-3   "#edb443")
  (set-face-foreground 'eat-term-color-4   "#195466")
  (set-face-foreground 'eat-term-color-5   "#4e5166")
  (set-face-foreground 'eat-term-color-6   "#33859e")
  (set-face-foreground 'eat-term-color-7   "#99d1ce")
  (set-face-foreground 'eat-term-color-8   "#11151c")
  (set-face-foreground 'eat-term-color-9   "#d26937")
  (set-face-foreground 'eat-term-color-10  "#091f2e")
  (set-face-foreground 'eat-term-color-11  "#245361")
  (set-face-foreground 'eat-term-color-12  "#0a3749")
  (set-face-foreground 'eat-term-color-13  "#888ca6")
  (set-face-foreground 'eat-term-color-14  "#599cab")
  (set-face-foreground 'eat-term-color-15  "#d3ebe9"))
#+end_src
* everywhere
seems not to run on wayland (yet?)

here is a script https://thanosapollo.org/posts/use-emacs-everywhere/
replicating its functionality on wayland. it needs =wtype= to be installed.

#+begin_src emacs-lisp
(defun thanos/wtype-text (text)
  "Process TEXT for wtype, handling newlines properly."
  (let* ((has-final-newline (string-match-p "\n$" text))
         (lines (split-string text "\n"))
         (last-idx (1- (length lines))))
    (string-join
     (cl-loop for line in lines
              for i from 0
              collect (cond
                       ;; Last line without final newline
                       ((and (= i last-idx) (not has-final-newline))
                        (format "wtype -s 350 \"%s\"" 
                                (replace-regexp-in-string "\"" "\\\\\"" line)))
                       ;; Any other line
                       (t
                        (format "wtype -s 350 \"%s\" && wtype -k Return" 
                                (replace-regexp-in-string "\"" "\\\\\"" line)))))
     " && ")))

(defun thanos/type ()
  "Launch a temporary frame with a clean buffer for typing."
  (interactive)
  (let ((frame (make-frame '((name . "emacs-float")
                             (fullscreen . 0)
                             (undecorated . t)
                             (width . 70)
                             (height . 20))))
        (buf (get-buffer-create "emacs-float")))
    (select-frame frame)
    (switch-to-buffer buf)
    (erase-buffer)
    (org-mode)
    (setq-local header-line-format
                (format " %s to insert text or %s to cancel."
                        (propertize "C-c C-c" 'face 'help-key-binding)
			(propertize "C-c C-k" 'face 'help-key-binding)))
    (local-set-key (kbd "C-c C-k")
		   (lambda () (interactive)
		     (kill-new (buffer-string))
		     (delete-frame)))
    (local-set-key (kbd "C-c C-c")
		   (lambda () (interactive)
		     (start-process-shell-command
		      "wtype" nil
		      (thanos/wtype-text (buffer-string)))
		     (delete-frame)))))
#+end_src

